docs/documentation/test/appendix/Performance test reports/100.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 141.19.142.198 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        141.19.142.198
Server Port:            80

Document Path:          /demo/api/articles?q=wwxxcvcdsww
Document Length:        460 bytes

Concurrency Level:      100
Time taken for tests:   3.011 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Non-2xx responses:      10000
Total transferred:      6930000 bytes
HTML transferred:       4600000 bytes
Requests per second:    3321.37 [#/sec] (mean)
Time per request:       30.108 [ms] (mean)
Time per request:       0.301 [ms] (mean, across all concurrent requests)
Transfer rate:          2247.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.8      0      16
Processing:     0   30   7.7     31      62
Waiting:        0   20  10.0     16      62
Total:          0   30   7.7     31      62

Percentage of the requests served within a certain time (ms)
  50%     31
  66%     31
  75%     31
  80%     31
  90%     31
  95%     47
  98%     47
  99%     47
 100%     62 (longest request)