docs/documentation/test/appendix/Performance test reports/1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 141.19.142.198 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        141.19.142.198
Server Port:            80

Document Path:          /demo/api/articles?q=wwxxcvcdsww
Document Length:        460 bytes

Concurrency Level:      1000
Time taken for tests:   9.875 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Non-2xx responses:      10000
Total transferred:      6930000 bytes
HTML transferred:       4600000 bytes
Requests per second:    1012.68 [#/sec] (mean)
Time per request:       987.482 [ms] (mean)
Time per request:       0.987 [ms] (mean, across all concurrent requests)
Transfer rate:          685.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  42.5      0    3011
Processing:    31  658 1158.6    390    6380
Waiting:       16  494 1173.7    218    6334
Total:         31  659 1160.1    390    6380

Percentage of the requests served within a certain time (ms)
  50%    390
  66%    390
  75%    390
  80%    406
  90%    406
  95%   3385
  98%   6365
  99%   6365
 100%   6380 (longest request)