docs/documentation/test/appendix/Performance test reports/50.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 141.19.142.198 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        141.19.142.198
Server Port:            80

Document Path:          /demo/api/articles?q=wwxxcvcdsww
Document Length:        460 bytes

Concurrency Level:      50
Time taken for tests:   3.541 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Non-2xx responses:      10000
Total transferred:      6930000 bytes
HTML transferred:       4600000 bytes
Requests per second:    2823.90 [#/sec] (mean)
Time per request:       17.706 [ms] (mean)
Time per request:       0.354 [ms] (mean, across all concurrent requests)
Transfer rate:          1911.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.9      0      16
Processing:     0   17   5.4     16      47
Waiting:        0   12   7.1     16      31
Total:          0   18   5.5     16      47

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     16
  75%     16
  80%     16
  90%     31
  95%     31
  98%     31
  99%     31
 100%     47 (longest request)