docs/documentation/test/appendix/Performance test reports/500.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 141.19.142.198 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        141.19.142.198
Server Port:            80

Document Path:          /demo/api/articles?q=wwxxcvcdsww
Document Length:        460 bytes

Concurrency Level:      500
Time taken for tests:   6.396 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Non-2xx responses:      10000
Total transferred:      6930000 bytes
HTML transferred:       4600000 bytes
Requests per second:    1563.47 [#/sec] (mean)
Time per request:       319.801 [ms] (mean)
Time per request:       0.640 [ms] (mean, across all concurrent requests)
Transfer rate:          1058.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  30.2      0    3011
Processing:    16  265 544.6    172    3198
Waiting:        0  194 547.7     94    3182
Total:         16  266 545.4    172    3198

Percentage of the requests served within a certain time (ms)
  50%    172
  66%    187
  75%    187
  80%    187
  90%    187
  95%    203
  98%   3182
  99%   3198
 100%   3198 (longest request)