docs/documentation/test/appendix/Performance test reports/5000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 141.19.142.198 (be patient)


Server Software:        Apache/2.4.7
Server Hostname:        141.19.142.198
Server Port:            80

Document Path:          /demo/api/articles?q=wwxxcvcdsww
Document Length:        460 bytes

Concurrency Level:      5000
Time taken for tests:   40.934 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Non-2xx responses:      10000
Total transferred:      6930000 bytes
HTML transferred:       4600000 bytes
Requests per second:    244.29 [#/sec] (mean)
Time per request:       20467.236 [ms] (mean)
Time per request:       4.093 [ms] (mean, across all concurrent requests)
Transfer rate:          165.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4 104.2      0    3011
Processing:   593 11684 12609.8   2465   38220
Waiting:      203 10920 12520.7   2246   38033
Total:        593 11688 12612.3   2465   38220

Percentage of the requests served within a certain time (ms)
  50%   2465
  66%  14414
  75%  23306
  80%  26302
  90%  32261
  95%  35209
  98%  38189
  99%  38204
 100%  38220 (longest request)